---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.GetDBServerId
source: html/bcc340a8-a842-7227-abec-c94b3bb662a3.htm
---
# Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.GetDBServerId Method

Returns the Id of the corresponding DB server for which this server provides an optional UI.

## Syntax (C#)
```csharp
Guid GetDBServerId()
```

## Returns
The Id of the DB server.

## Remarks
Note that there may be only one UI server assigned to a DB calculation server.